function citysOnChange(obj1,obj2) {

   sector = new Array();
   sector[0]=new Array('請選擇');
   sector[1]=new Array('七堵區','中山區','中正區','仁愛區','安樂區','信義區','暖暖區');
   sector[2]=new Array('士林區','大同區','大安區','中山區','中正區','內湖區','文山區','北投區','松山區','信義區','南港區','萬華區');
   sector[3]=new Array('八里鄉','三芝鄉','三重市','三峽鎮','土城市','中和市','五股鄉','平溪鄉','永和市','石門鄉','石碇鄉','汐止市'
   ,'坪林鄉','林口鄉','板橋市','金山鄉','泰山鄉','烏來鄉','貢寮鄉','淡水鎮','深坑鄉','新店市','新莊市','瑞芳鎮','萬里鄉','樹林市'
   ,'雙溪鄉','蘆洲市','鶯歌鎮');
   sector[4]=new Array('八德市','大園鄉','大溪鎮','中壢市','平鎮市','桃園市','復興鄉','新屋鄉','楊梅鎮','龍潭鄉','龜山鄉','蘆竹鄉','觀音鄉');
   sector[5]=new Array('東區','北區','香山區');
   sector[6]=new Array('五峰鄉','北埔鄉','尖石鄉','竹北市','竹東鎮','芎林鄉','峨眉鄉','湖口鄉','新埔鎮','新豐鄉','橫山鄉','關西鎮','寶山鄉');
   sector[7]=new Array('三義鄉','三灣鄉','大湖鄉','公館鄉','竹南鎮','西湖鄉','卓蘭鎮','南庄鄉','後龍鎮','苗栗市','苑裡鎮','泰安鄉','通霄鎮'
   ,'造橋鄉','獅潭鄉','銅鑼鄉','頭份鎮','頭屋鄉');
   sector[8]=new Array('中區','北屯區','北區','西屯區','西區','東區','南屯區','南區');
   sector[9]=new Array('大甲鎮','大安鄉','大肚鄉','大里市','大雅鄉','太平市','外埔鄉','石岡鄉','后里鄉','沙鹿鎮','和平鄉','東勢鎮','烏日鄉'
   ,'神岡鄉','梧棲鎮','清水鎮','新社鄉','潭子鄉','龍井鄉','豐原市','霧峰鄉');
   sector[10]=new Array('二水鄉','二林鎮','大村鄉','大城鄉','北斗鎮','永靖鄉','田中鎮','田尾鄉','竹塘鄉','伸港鄉','秀水鄉','和美鎮'
   ,'社頭鄉','芳苑鄉','花壇鄉','芬園鄉','員林鎮','埔心鄉','埔鹽鄉','埤頭鄉','鹿港鎮','溪州鄉','溪湖鎮','彰化市','福興鄉','線西鄉');
   sector[11]=new Array('中寮鄉','仁愛鄉','水里鄉','名間鄉','竹山鎮','信義鄉','南投市','埔里鎮','草屯鎮','國姓鄉','魚池鄉','鹿谷鄉'
   ,'集集鎮');
   sector[12]=new Array('二崙鄉','口湖鄉','土庫鎮','大埤鄉','元長鄉','斗六市','斗南鎮','水林鄉','北港鎮','古坑鄉','台西鄉','四湖鄉'
   ,'西螺鎮','東勢鄉','林內鄉','虎尾鎮','崙背鄉','麥寮鄉','莿桐鄉','褒忠鄉');
   sector[13]=new Array('東區','西區');
   sector[14]=new Array('大林鎮','大埔鄉','中埔鄉','六腳鄉','太保市','水上鄉','布袋鎮','民雄鄉','朴子市','竹崎鄉','東石鄉','阿里山'
   ,'梅山鄉','鹿草鄉','番路鄉','新港鄉','溪口鄉','義竹鄉');
   sector[15]=new Array('中西區','北區','安平區','安南區','東區','南區');
   sector[16]=new Array('七股鄉','下營鄉','大內鄉','山上鄉','仁德鄉','六甲鄉','北門鄉','左鎮鄉','永康市','玉井鄉','白河鎮','安定鄉'
   ,'西港鄉','佳里鎮','官田鄉','東山鄉','南化鄉','後壁鄉','柳營鄉','將軍鄉','麻豆鎮','善化鎮','新化鎮','新市鄉','新營市','楠西鄉'
   ,'學甲鎮','龍崎鄉','歸仁鄉','關廟鄉','鹽水鎮');
   sector[17]=new Array('三民區','小港區','左營區','前金區','前鎮區','苓雅區','新興區','楠梓區','鼓山區','旗津區','鹽埕區');
   sector[18]=new Array('三民鄉','大社鄉','大寮鄉','大樹鄉','仁武鄉','內門鄉','六龜鄉','永安鄉','田寮鄉','甲仙鄉','杉林鄉'
   ,'岡山鎮','林園鄉','阿蓮鄉','美濃鎮','茄萣鄉','茂林鄉','桃源鄉','梓官鄉','鳥松鄉','湖內鄉','路竹鄉','旗山鎮','鳳山市'
   ,'橋頭鄉','燕巢鄉','彌陀鄉');
   sector[19]=new Array('九如鄉','三地門','內埔鄉','竹田鄉','牡丹鄉','車城鄉','里港鄉','佳冬鄉','來義鄉','枋山鄉','枋寮鄉'
   ,'東港鎮','林邊鄉','長治鄉','南州鄉','屏東市','恆春鎮','春日鄉','崁頂鄉','泰武鄉','琉球鄉','高樹鄉','新埤鄉','新園鄉'
   ,'獅子鄉','萬丹鄉','萬巒鄉','滿州鄉','瑪家鄉','潮州鎮','霧台鄉','麟洛鄉','鹽埔鄉');
   sector[20]=new Array('大武鄉','太麻里','台東市','成功鎮','池上鄉','卑南鄉','延平鄉','東河鄉','金峰鄉','長濱鄉','海端鄉'
   ,'鹿野鄉','達仁鄉','綠島鄉','關山鎮','蘭嶼鄉');
   sector[21]=new Array('玉里鎮','光復鄉','吉安鄉','秀林鄉','卓溪鄉','花蓮市','富里鄉','新城鄉','瑞穗鄉','萬榮鄉','壽豐鄉'
   ,'鳳林鎮','豐濱鄉');
   sector[22]=new Array('三星鄉','大同鄉','五結鄉','冬山鄉','壯圍鄉','宜蘭市','南澳鄉','員山鄉','頭城鎮','礁溪鄉','羅東鎮','蘇澳鎮');
   sector[23]=new Array('七美鄉','白沙鄉','西嶼鄉','馬公市','望安鄉','湖西鄉');
   sector[24]=new Array('金沙鎮','金城鎮','金湖鎮','金寧鄉','烈嶼鄉','烏坵鄉');
   sector[25]=new Array('北竿鄉','東引鄉','南竿鄉','莒光鄉');
   //sector[26]=new Array('東沙','南沙');
   //sector[27]=new Array('釣魚台');

  i = obj1.selectedIndex;
  obj2.length = sector[i].length;
  num=0;
  for(k = 1; k <= i; k++){
    num += sector[k-1].length;
  }
  for (j = 0; j < obj2.length; j ++) {

    obj2.options[j].value = sector[i][j];//num+j+1;
    obj2.options[j].text = sector[i][j];
  }
}

function initialCity(obj){

  citys = new Array();
  citys[0] = '請選擇';
  citys[1] = '基隆市';
  citys[2] = '台北市';
  citys[3] = '台北縣';
  citys[4] = '桃園縣';
  citys[5] = '新竹市';
  citys[6] = '新竹縣';
  citys[7] = '苗栗縣';
  citys[8] = '台中市';
  citys[9] = '台中縣';
  citys[10] = '彰化縣';
  citys[11] = '南投縣';
  citys[12] = '雲林縣';
  citys[13] = '嘉義市';
  citys[14] = '嘉義縣';
  citys[15] = '台南市';
  citys[16] = '台南縣';
  citys[17] = '高雄市';
  citys[18] = '高雄縣';
  citys[19] = '屏東縣';
  citys[20] = '台東縣';
  citys[21] = '花蓮縣';
  citys[22] = '宜蘭縣';
  citys[23] = '澎湖縣';
  citys[24] = '金門縣';
  citys[25] = '連江縣';

  obj.options.length = 0;
  for(i = 0; i < citys.length; i ++){
    obj.options[i] = new Option(citys[i],i);
  }
}

function initialCountry(obj){
  countris = new Array();
  countris[0] = '請選擇';
  obj.options.length = 0;
  for(i = 0; i < countris.length; i ++){
    obj.options[i] = new Option(countris[i],i);
  }
}
